biddr_api/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
  def index
    @auctions = Auction.all.order(created_at: :DESC)

SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "bids"."amount" DESC  [["auction_id", 4]]
---
  def show
    @bid = Bid.new
    @bids = @auction.bids.order(amount: :DESC)

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_auction
    @auction = Auction.find params[:id]