biddr_api/app/controllers/auctions_controller.rb

  def show
    @bid = Bid.new
    @bids = @auction.bids.order(price: :DESC)
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 ORDER BY "price" DESC  [["auction_id", 4]]