biddr_api/app/controllers/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "bids" ("amount", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 2.0], ["auction_id", 4], ["created_at", "2021-02-26 20:07:33.717015"], ["updated_at", "2021-02-26 20:07:33.717015"], ["user_id", 7]]
---
  def create
    @auction = Auction.find(params[:auction_id])
    @bid = Bid.new bid_params
    @bid.user = current_user
    @bid.auction = @auction
    if @bid.save