biddr_api/app/controllers/api/v1/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
  def index
    auctions = Auction.viewable.order(created_at: :desc)

INSERT INTO "auctions" ("title", "description", "reserve_price", "end_date", "created_at", "updated_at", "user_id", "aasm_state") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    auction = Auction.new auction_params
    auction.user = current_user
    auction.save!

DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 6]]
---
  def destroy
    @auction.destroy

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def find_auction
    @auction ||= Auction.find params[:id]