biddr_api/app/controllers/api/v1/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bids".* FROM "bids" ORDER BY "bids"."created_at" DESC
---
  def index
    @auction = Auction.find(params[:auction_id])
    bids = Bid.order(created_at: :desc)

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "bids" ("amount", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 24.0], ["auction_id", 10], ["created_at", "2019-12-03 02:06:15.086809"], ["updated_at", "2019-12-03 02:06:15.086809"], ["user_id", 1]]
---
  def create
    auction = Auction.find(params[:auction_id])
    bid = Bid.new bid_params
    bid.auction = auction
    bid.user = current_user
    bid.save!