biddr_api/app/controllers/api/v1/publishings_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def create
    a = Auction.find params[:auction_id]