biddr_api/app/controllers/api/v1/reservings_controller.rb

  def create
    a = Auction.find params[:auction_id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]